#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
module.ec2.tls_private_key.example: Refreshing state... [id=59d5f1108833dc42c8e33b118a9ad91085592b8d]
module.ec2.aws_key_pair.example: Refreshing state... [id=hcltech-trainings]
module.vpc.aws_vpc.demo_vpc: Refreshing state... [id=vpc-0db58e53fbf193e16]
module.vpc.aws_internet_gateway.demo_igw: Refreshing state... [id=igw-05522958625cf5ca5]
module.vpc.aws_subnet.public_subnet_a: Refreshing state... [id=subnet-0dc9d07d024cbe233]
module.vpc.aws_subnet.public_subnet_b: Refreshing state... [id=subnet-023776ecdb234fd29]
module.ec2.aws_security_group.demo_sg: Refreshing state... [id=sg-07ac9cf0974c393f3]
module.alb.aws_lb_target_group.demo_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:225748035722:targetgroup/demo-tg/06b0946645419ec3]
module.vpc.aws_route_table.public_rt1: Refreshing state... [id=rtb-0f9ed86a26db03d43]
module.alb.aws_lb.demo_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:225748035722:loadbalancer/app/demo-alb/d84e162353250906]
module.ec2.aws_instance.demo_instance: Refreshing state... [id=i-000b656634a95a860]
module.vpc.aws_route_table_association.rt_assc_1: Refreshing state... [id=rtbassoc-0e310eccf1be2366d]
module.vpc.aws_route_table_association.rt_assc_2: Refreshing state... [id=rtbassoc-0b3a9189a1512bac8]
module.alb.aws_lb_listener.demo_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:225748035722:listener/app/demo-alb/d84e162353250906/7c376a15311e94d0]
module.alb.aws_lb_target_group_attachment.demo_tg_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:225748035722:targetgroup/demo-tg/06b0946645419ec3-20250616060816340300000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb_target_group_attachment.demo_tg_attachment must be replaced
-/+ resource "aws_lb_target_group_attachment" "demo_tg_attachment" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:225748035722:targetgroup/demo-tg/06b0946645419ec3-20250616060816340300000002" -> (known after apply)
      ~ target_id        = "i-000b656634a95a860" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2.aws_instance.demo_instance must be replaced
-/+ resource "aws_instance" "demo_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:225748035722:instance/i-000b656634a95a860" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-000b656634a95a860" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e1c7d1a406d38518" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-168.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.168" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "demo-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0015ff04601aa3294" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ instance_id        = "i-000b656634a95a860" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @sai-kumar9020, Action: `pull_request`*